import torch

# Тензор може містити тільки однакову кількість даних у масивах
# На прикладі показаний 2D тензор
# 1D тензор називається вектором (1 масив усередині)
# 2D тензор називається матрицею (масив масивів векторів)
# 3D тензор
t = torch.tensor([[1,2,3], [1,2,3]])


# дозволяє дізнатися виміри тензора, чим більше вкладеність
# тим більше вимір
t2 = t.ndim

#визначає виміри тензора, тобто кількість елементів по кожному виміру.
# Це можна інтерпретувати як кількість векторів (або "рядків" і "стовпців")
#  та кількість елементів в кожному з них.
t3 = t.size()

# Створює рандомний тензор, приймає розмір, в даному прикладу створює тензор
# розміром 3з4. Також опціонально приймає тип даних через dtype, але рандом 
# може генерувати тільки числа з плаваючою комою. Також приймає device, 
# воно вирішує чи буде тензор згенеровано на CPU чи на GPU.
random_tensor = torch.rand(3,4, dtype=torch.float32,device="cpu")

