import torch 
import numpy as np

# Створюємо тензор розміром (1, 9), що містить значення від 1 до 9
x = torch.arange(1., 10.)

# Перероблюємо розмір тензора на (9, 1). Новий розмір має дорівнювати числу елементів у попередньому тензорі.
# Тобто ми перетворюємо вектор з 9 елементів в стовпчик з 9 рядків по одному елементу
x_reshaped = x.reshape(9, 1)

# Також можна перетворити на 3 на 3. Головне що б розмір дорівнював початковому. 9*1=9, 3*3 = 9
x_reshaped = x.reshape(3, 3)

# reshape() може створити нову копію з новою пам'яттю, що дозволяє змінювати форму без впливу на оригінальний тензор.
# view() працює без створення нової пам'яті і використовує те ж саме місце в пам'яті, що й оригінальний тензор, але тільки якщо тензор неперервний.
z = x.view(3,3)

# torch.stack() об'єднує кілька тензорів в один по певній осі (вимірі).
# dim=0: Об'єднує тензори вертикально (нові рядки додаються до результату).
# dim=1: Об'єднує тензори горизонтально (нові стовпці додаються поруч з іншими).
# Замість того, щоб модифікувати оригінальні тензори, ця операція створює новий тензор з об'єднаними елементами.
stacked = torch.stack([x,x,x,x],dim=1)

squeeze_tensor = torch.rand([3,1,3,1])

# Функція torch.squeeze використовується для видалення осей (дименсій) розміру 1 із тензора. Це дозволяє "спрощувати"
#  структуру тензора, зменшуючи його вкладеність, але залишаючи всі дані недоторканими.
# Можна видалити тільки конкретну дименсію розміру 1, це можна зробити, вказавши її номер (позицію) у параметрі -
# dim функції torch.squeeze. Нумерація починається з 0.
# Unsqueeze робить усе навпаки, воно додає додаткову дименцію в задане положення, за замовчуванням 0 індекс
torch.squeeze(squeeze_tensor,dim=3)
torch.unsqueeze(squeeze_tensor,dim=0)


# Міняє місцями дименції, це вигляд (view) він має одну і ту ж памʼять з оригіналом. 
# Може працювати з різними вимірами, 2D, 3D,4D тощо. Приймає кортеж дименцій.
# Для використання копіювання задля відокремлення памʼяті можна скористуватися методом permute_copy
torch.permute(x_reshaped, (1,0))
torch.permute_copy(x_reshaped,(0,1))

# Міняє місцями дименції, це вигляд (view) він має одну і ту ж памʼять з оригіналом. 
# Може працювати з тільки з двома вимірами. Приймає тільки 2 дименції 0 або 1
# Для використання копіювання задля відокремлення памʼяті можна скористуватися методом transpose_copy
torch.transpose(x_reshaped, 1,0)
torch.transpose_copy(x_reshaped, 0, 1)

#Cтворення нампай масиву
y = np.arange(1.,8.)

# При перетворенні масива на тензор, dtype завжди буде float64 бо у нампай масиві цей тип є по замовчуванню. 
# У тензора тип по замовчуванню float32, тож воно конвертує масив у тензор з типом float64, а щоб змінити тип, можна скористатися
# Методом .type() та всередині вказати тип 
x = torch.from_numpy(y)

z = torch.ones(7)

# Перетворює тензо на масив NumPy. Так як дефолтний тип у тензора float32 то нампай масив його наслідує. Що б змінити на стандартний тип масиву для
# NumPy, треба прописати метод astype де вказати тип NP
a = z.numpy().astype(np.float64)