import torch 

x = torch.arange(1,10).reshape(1,3,3)

#Схожа аналогія як для масивів
print(x[0])

# Можна використати індексування в одних дужках або в декількох [0][0]
print(x[0,0])

print(x[0,0,0])

# Двокрапка (:) дає можливість обрати всі елементи конкретного виміру. Якщо твій перший вимір завжди 0 (наприклад, у 
# тензорів, які мають вигляд [1, 3, 3] або [1, :, :]), тоді : у першому вимірі працюватиме так само, як вибір конкретного індексу 0. 
# Однак далі ти можеш використовувати двокрапку, щоб обрати всі елементи інших вимірів, або вказувати конкретні індекси для більш точного вибору.
print(x[:,:, 2])

print(x[:,1,:])